{
  "questions1": [
    "What was your favorite memory together?",
    "How do you navigate disagreements or conflicts?",
    "What are your individual and shared goals for the future?",
    "Where would you like to travel to?",
    "What is your love language?",
    "What is the most romantic thing someone has done for you?",
    "Best adventure you have been on?",
    "What items are in your bucket list?",
    "What is your ideal date?"
  ],
  "questions2": [
    "What was your favorite childhood memory?",
    "How do you handle stress or pressure?",
    "What inspires you to keep moving forward?",
    "If you could live anywhere in the world, where would it be?",
    "How do you express affection towards others?",
    "Describe a time when you felt truly appreciated.",
    "What's an activity you've always wanted to try?",
    "What goals do you hope to achieve in the next year?",
    "What would your perfect day look like?"
  ],
  "questions3": [
    "What do you value most in a relationship?",
    "How do you feel about sharing your deepest fears or insecurities?",
    "What role does physical intimacy play in your relationship?",
    "How do you envision your future together?",
    "What are your thoughts on starting a family?",
    "Describe your ideal living situation with your partner.",
    "How do you handle financial decisions as a couple?",
    "What are your thoughts on marriage or commitment?",
    "How do you support each other during tough times?"
  ],
  "questions4": [
    "What is your biggest fear about the relationship?",
    "What is something you wish your partner understood better about you?",
    "How do you prioritize quality time together?",
    "What are your boundaries when it comes to friendships with the opposite sex?",
    "How do you handle jealousy or insecurity?",
    "What do you need from your partner when you're feeling vulnerable?",
    "Describe a time when you felt deeply connected to your partner.",
    "What are your thoughts on forgiveness and moving past conflicts?",
    "How do you keep the spark alive in your relationship?"
  ],
  "questions5": [
    "What is a hobby you've always wanted to pick up?",
    "If you could meet any historical figure, who would it be and why?",
    "What is a book or movie that has had a significant impact on your life?",
    "How do you like to spend your weekends?",
    "What is your favorite way to relax after a long day?",
    "If you could have any superpower, what would it be and why?",
    "What is your favorite dish to cook or eat?",
    "What is one thing you want to learn or improve this year?",
    "Describe a dream project or goal you'd like to achieve someday."
  ]
}
